import numpy as np


# Задание 8.4 С помощью введённого 
# ранее критерия сонаправленности найдите пару 
# сонаправленных векторов среди векторов a, b и c.
a = np.array([23, 34, 27])
b = np.array([-54,   1,  46])
c = np.array([46, 68, 54])
             
import numpy as np
print(a, b, c)
norm_a = np.linalg.norm(a)
norm_b = np.linalg.norm(b)
norm_c = np.linalg.norm(c)

norm_ab = np.linalg.norm(a+b)
norm_ac = np.linalg.norm(a+c)
norm_bc = np.linalg.norm(b+c)

if norm_a+ norm_b == norm_ab: print('a+b = ab', norm_a, norm_b, norm_ab)
if norm_a+ norm_c == norm_ac: print('a+c = ac', norm_a, norm_c, norm_ac)
if norm_b+ norm_c == norm_bc: print('b+c = bc', norm_b, norm_c, norm_bc)


# 8.5 Найдите пару векторов, расстояние между которыми больше 100.

length_ab = np.linalg.norm(a-b)
length_ac = np.linalg.norm(a-c)
length_bc = np.linalg.norm(b-c)

if  length_ab > 100 : print('a-b >100',  length_ab)
if  length_ac > 100 : print('a-c >100',  length_ac)
if  length_bc > 100 : print('b-c >100',  length_bc)


# Задание 8.6 Найдите пару перпендикулярных 
# векторов с помощью скалярного произведения (оно должно быть равно нулю).

dot_ab = np.dot(a, b)
dot_ac = np.dot(a, c)
dot_bc = np.dot(b, c)

if  dot_ab == 0 : print('dot(a,b) = 0',  dot_ab)
if  dot_ac == 0 : print('dot(a,c) = 0',  dot_ac)
if  dot_bc == 0 : print('dot(b,c) = 0',  dot_bc)

print(dot_ab, dot_ac, dot_bc )


mystery2 = np.array([481, 18, 308, 13, 652, 391, 63, 62, 353, 111, 805, 251, 36, 544, 600, 799, 283, 880
, 470, 599, 814, 507, 242, 650, 180, 860, 979, 298, 621, 197, 572, 976, 905, 427, 119, 905
, 64, 430, 742, 563, 382, 211, 228, 760, 567, 366, 103, 409, 211, 952, 5, 493, 151, 267
, 517, 495, 375, 80, 341, 39, 560, 85, 490, 44, 17, 151, 42, 688, 648, 501, 437, 154
, 66, 28, 921, 642, 196, 719, 208, 492, 538, 687, 841, 933, 386, 719, 114, 261, 838, 228
, 120, 508, 316, 476, 233, 902, 698, 471, 604, 172, 993, 790, 557, 129, 446, 64, 317, 997
, 509, 710, 909, 147, 228, 595, 188, 246, 728, 509, 365, 139, 773, 426, 929, 888, 534, 513
, 666, 77, 299, 943, 985, 588, 137, 31, 385, 405, 980, 854, 327, 714, 318, 909, 803, 334
, 130, 949, 532, 640, 820, 975, 889, 240, 878, 294, 899, 488, 639, 961, 819, 649, 939, 163
, 209, 879, 479, 573, 557, 25, 783, 332, 311, 425, 140, 678, 766, 492, 234, 316, 811, 447
, 772, 325, 640, 387, 858, 208, 739, 870, 227, 385, 24, 286, 22, 599, 951, 994, 457, 99
, 238, 172, 549, 932, 412, 545, 713, 19, 785, 931, 684, 333, 630, 752, 191, 949, 200, 361
, 887, 243, 753, 600, 635, 243, 173, 249, 294, 583, 106, 772, 848, 387, 874, 321, 562, 96
, 211, 561, 918, 868, 206, 745, 710, 869, 387, 600, 726, 179, 336, 806, 392, 612])

# Задание 8.7 Найдите минимальное значение в массиве mystery2 
print(mystery2.min())
# Задание 8.8 Найдите среднее значение массива. Ответ не округляйте.
print(mystery2.mean())
# Задание 8.9 Найдите медиану массива.
print(np.median(mystery2))
# Задание 8.10 Найдите стандартное отклонение значений в массиве. Ответ округлите до сотых.
print(round(np.std(mystery2), 2))