cheese_data = {
    'чеддер': [370, 5000, 33, 'твердый'],
    'пармезан': [510, 4000, 29, 'твердый'],
    'гауда': [250, 3700, 27, 'полутвердый'],
    'эдам': [220, 10000, 30, 'полутвердый'],
    'горгонзола': [320, 3000, 32, 'полумягкий'],
    'рокфор': [340, 15000, 31, 'полумягкий'],
    'стилтон': [360, 7000, 35, 'полумягкий'],
    'камамбер': [250, 8000, 24, 'мягкий'],
    'бри': [310, 6500, 28, 'мягкий'],
}

## Введите свое решение ниже
def filter_by_fat (cheese_data, n):  #принимает на вход словарь cheese_data и число n и 
                                    #возвращает словарь, ключами которого являются названия сыров, а значениями — их жирность.
    
    filter_func = lambda item : item[1][2] < n  # Функция фильтрации по значениию меньше n
    mapped_func = lambda item : (item[0],item[1][2]) 

    filter_by_fat_dict = dict(filter(filter_func, cheese_data.items())) 
    filter_by_fat_dict = dict(map(mapped_func, filter_by_fat_dict.items()))

    return filter_by_fat_dict

cheese_data = {
    'чеддер': [370, 5000, 33, 'твердый'],
    'пармезан': [510, 4000, 29, 'твердый'],
    'гауда': [250, 3700, 27, 'полутвердый'],
    'эдам': [220, 10000, 30, 'полутвердый'],
    'горгонзола': [320, 3000, 32, 'полумягкий'],
    'рокфор': [340, 15000, 31, 'полумягкий'],
    'стилтон': [360, 7000, 35, 'полумягкий'],
    'камамбер': [250, 8000, 24, 'мягкий'],
    'бри': [310, 6500, 28, 'мягкий'],
}

print(filter_by_fat(cheese_data, n=30))
# {'пармезан': 29, 'гауда': 27, 'камамбер': 24, 'бри': 28}

print(filter_by_fat(cheese_data, n=25))
# {'камамбер': 24}


